'''Вспомните какие модули вы уже проходили на курсе.
Создайте файл, в котором вы импортируете встроенные в модуль функции под псевдонимами. (3-7 строк импорта).'''

import random
import sys
import math

num = random.randint(1, 10)
print(num)

sys.path

a = math.cos(30)
print(a)

sys.exit()